tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
brew "commitizen"
brew "fd"
brew "fzf"
brew "git"
brew "libpng"
brew "lazygit"
brew "mas"
brew "neovim"
brew "nodenv"
brew "php"
brew "pyenv"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "yarn"
cask "adobe-creative-cloud"
cask "alfred"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "firefox"
cask "figma"
cask "font-noto-sans-cjk"
cask "font-noto-sans-cjk-jp"
cask "iterm2"
cask "karabiner-elements"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "notion"
cask "sublime-text"
cask "transmit"
cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Display Menu", id: 549083868
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "SiteSucker", id: 442168834
mas "Stay", id: 435410196
mas "Xcode", id: 497799835
